import 'package:adkar/main.dart';
import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';
import 'package:flutter_staggered_animations/flutter_staggered_animations.dart';
import 'package:flutter/services.dart';
import 'package:provider/provider.dart';
import 'package:share_plus/share_plus.dart';

import 'package:adkar/navbar/favorites_provider.dart';

class Nar extends StatefulWidget {
  @override
  _NarState createState() => _NarState();
}

class _NarState extends State<Nar> {
  List<Map<String, String>> _dhikrList = [
    {
      "text":
          "عن ابن عباس - رضي الله عنهما - أنه قال في قوله تعالى: {إنها ترمي بشرر كالقصر} قال: كنا نعمد إلى الخشبة ثلاثة أذرع أو فوق ذلك، فنرفعه للشتاء فنسميه القصر، {كأنه جمالة صفر} قال: حبال السفن، تجمع حتى تكون كأوساط الرجال.",
      "explanation": "رواه ابن سعد"
    },
    {
      "text":
          "عن أنس - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم - لجبريل - عليه السلام -: ما لي لم أر ميكائيل ضاحكا قط؟ قال: ما ضحك ميكائيل منذ خلقت النار.",
      "explanation": "رواه أحمد"
    },
    {
      "text":
          "عن النعمان بن بشير - رضي الله عنه - قال: سمعت رسول الله - صلى الله عليه وسلم - يخطب يقول: \"أنذرتكم النار، أنذرتكم النار، أنذرتكم النار، حتى لو أن رجلا كان في [أقصى] السوق لسمعه من مقامي هذا، حتى وقعت خميصة كانت على عاتقه عند رجليه.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن عمر - رضي الله عنه - قال: أكثروا ذكر النار، فإن حرها شديد، وإن قعرها بعيد، وإن مقامعها حديد.",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "قال تعالى: {وإن جهنم لموعدهم أجمعين، لها سبعة أبواب، لكل باب منهم جزء مقسوم} وعن عتبة بن عمرو السلمي - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"الجنة لها ثمانية أبواب، والنار لها سبعة أبواب.\"",
      "explanation": "رواه البخاري"
    },
    {
      "text":
          "عن أبي هريرة - رضي الله عنه - قال: كنا عند رسول الله - صلى الله عليه وسلم - يوما، فسمعنا وجبة فقال رسول الله - صلى الله عليه وسلم -: \"تدرون ما هذا؟\" فقلنا: الله ورسوله أعلم، قال: \"هذا حجر رمي به في جهنم منذ سبعين خريفا، فهو يهوي في النار حتى الآن انتهى إلى قعرها.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن معاذ بن جبل - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"والذي نفس محمد بيده، إن قدر ما بين شفير النار وقعرها، كصخرة زنتها سبع خلفات بشحومهن ولحومهن وأولادهن، تهوي فيما بين شفير النار إلى أن تبلغ قعرها سبعين خريفا.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن مجاهد قال: قال لي ابن عباس - رضي الله عنهما -: أتدري ما سعة جهنم؟ قلت: لا، قال: أجل والله ما تدري، إن بين شحمة أذن أحدهم وبين عاتقه مسيرة سبعين خريفا، تجري فيها أودية القيح والدم.",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن ثوبان مولى رسول الله - صلى الله عليه وسلم - قال: كنت قائما عند رسول الله - صلى الله عليه وسلم - فجاء حبر من أحبار اليهود، فقال: السلام عليك يا محمد، فدفعته دفعة كاد يصرع منها، فقال: لم تدفعني؟ فقلت: ألا تقول يا رسول الله؟ فقال اليهودي: إنما ندعوه باسمه الذي سماه به أهله، فقال رسول الله - صلى الله عليه وسلم -: \"إن اسمي الذي سماني به أهلي محمد\".",
      "explanation": "رواه البخاري"
    },
    {
      "text":
          "عن خالد بن عمير العدوي قال: خطبنا عتبة بن غزوان - رضي الله عنه - وكان أميرا على البصرة، فحمد الله وأثنى عليه ثم قال: أما بعد، فإن الدنيا قد آذنت بصرم وولت حذاء، ولم يبق منها إلا صبابة كصبابة الإناء يتصابها صاحبها، وإنكم منتقلون منها إلى دار لا زوال لها، فانتقلوا بخير ما بحضرتكم.",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن أبي سعيد الخدري - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"ناركم هذه التي توقدون، جزء واحد من سبعين جزءا من حر نار جهنم.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن أبي هريرة - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"أتحسبون أن نار جهنم مثل ناركم هذه؟ هي أشد سوادا من القار، هي جزء من بضعة وستين جزءا منها.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن النعمان بن بشير - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"إن أهون أهل النار عذابا يوم القيامة رجل توضع في أخمص قدميه جمرتان، يغلي منهما دماغه كما يغلي المرجل.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن ابن عباس - رضي الله عنهما - قال: قال رسول الله - صلى الله عليه وسلم -: \"أهون أهل النار عذابا أبو طالب، لعله تنفعه شفاعتي يوم القيامة، فيجعل في ضحضاح من النار يبلغ كعبيه.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن أنس بن مالك - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"يؤتى بأنعم أهل الدنيا من أهل النار يوم القيامة، فيقال: اغمسوه في النار غمسة، فيغمس فيها، ثم يقال له: يا ابن آدم، هل رأيت خيرا قط؟ فيقول: لا والله يا رب، ما رأيت خيرا قط.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن أبي ذر - رضي الله عنه - قال: كنا مع رسول الله - صلى الله عليه وسلم - في سفر، ومعه بلال، فأراد أن يؤذن للظهر، فقال له رسول الله - صلى الله عليه وسلم -: \"انتظر، انتظر\" ثم أراد أن يؤذن، فقال له رسول الله - صلى الله عليه وسلم -: \"أبرد\".",
      "explanation": "رواه البخاري"
    },
    {
      "text":
          "عن أبي هريرة - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"لو كان في هذا المسجد مائة ألف أو يزيدون، وفيه رجل من أهل النار، فتنفس فأصابهم نفسه، لاحترق المسجد ومن فيه.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن عبد الله بن مسعود - رضي الله عنه - أنه قال في قوله - عز وجل -: {وقودها الناس والحجارة} قال: \"حجارة من كبريت، خلقها الله عنده كما شاء.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن أبي هريرة - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"ما بين منكبي الكافر في النار مسيرة ثلاثة أيام للراكب المسرع، وغلظ جلده اثنان وأربعون ذراعا، بذراع الجبار.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن زيد بن أرقم - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"إن الرجل من أهل النار ليعظم للنار، حتى يكون الضرس من أضراسه كأحد.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن ابن عباس - رضي الله عنهما - قال: \"قرأ رسول الله - صلى الله عليه وسلم - {يا أيها الذين آمنوا اتقوا الله حق تقاته ولا تموتن إلا وأنتم مسلمون} ثم قال: لو أن قطرة من الزقوم قطرت في الأرض لأفسدت على أهل الدنيا معيشتهم، فكيف بمن هو طعامه؟ وليس له طعام غيره؟\"",
      "explanation": "رواه البخاري"
    },
    {
      "text":
          "عن أبي الدرداء - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"يلقى على أهل النار الجوع، فيعدل ما هم فيه من العذاب، فيستغيثون فيغاثون بطعام من ضريع لا يسمن ولا يغني من جوع، فيستغيثون بالطعام، فيغاثون بطعام ذي غصة.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن عبد الله بن مسعود - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"إن أهل النار يموتون موتة واحدة، ثم يحيون بموتة أخرى فيموتون مرة أخرى.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن عائشة - رضي الله عنها - قالت: قال رسول الله - صلى الله عليه وسلم -: \"من نزلت به فاقة، فليأخذ القرآن، فله بكل حرف عشر حسنات، فلا يخرج من الدنيا حتى يغنيه الله بفضل ذلك.\"",
      "explanation": "رواه أحمد"
    },
    {
      "text":
          "عن أبي هريرة - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"من لا يتبع من أهل النار هدية لأهله، فوالله ما كانت آية في كتاب الله، فما كان لي ما أكرهه.\"",
      "explanation": "رواه البخاري"
    },
    {
      "text":
          "عن جابر بن عبد الله - رضي الله عنهما - قال: قال رسول الله - صلى الله عليه وسلم -: \"مثل المؤمنين في توادهم وتراحمهم كمثل الجسد، إذا اشتكى منه عضو تداعى له سائر الجسد بالسهر والحمى.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن عبد الله بن عمر - رضي الله عنهما - قال: قال رسول الله - صلى الله عليه وسلم -: \"أرأيتم إذا كان الماء طاهرا، فهل يصلح للوضوء؟\"",
      "explanation": "رواه أحمد"
    },
    {
      "text":
          "عن أبي هريرة - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"من لا يشكر الناس لا يشكر الله.\"",
      "explanation": "رواه أحمد"
    },
    {
      "text":
          "عن أبي بكر الصديق - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"ما من مسلم يسأل الله الجنة ثلاث مرات إلا قالت الجنة: اللهم أدخله الجنة، وما من مسلم يستعيذ بالله من النار ثلاث مرات إلا قالت النار: اللهم أعتقه من النار.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن سعد بن أبي وقاص - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"إن الله لا يظلم المؤمنين مثقال ذرة، وإنه لو عمل خيراً يجزه عليه، أو عمل شراً يجزه عليه.\"",
      "explanation": "رواه البخاري"
    },
    {
      "text":
          "عن جابر بن عبد الله - رضي الله عنهما - قال: قال رسول الله - صلى الله عليه وسلم -: \"إن الله لا يظلم المؤمنين مثقال ذرة، وإنه لو عمل خيراً يجزه عليه، أو عمل شراً يجزه عليه.\"",
      "explanation": "رواه البخاري"
    },
    {
      "text":
          "عن عبد الله بن الحارث بن جزء الزبيدي - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"إن في النار حيات كأمثال أعناق البخت تلسع إحداهن اللسعة، فيجد حموتها أربعين خريفا، وإن في النار عقارب كأمثال البغال الموكفة تلسع إحداهن اللسعة، فيجد حموتها أربعين سنة.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن مجاهد، عن يزيد بن شجرة الرهاوي - وكان من أمراء الشام - قال: \"إن لجهنم ساحلا كساحل البحر، فيه هوام وحيات كالنخل، وعقارب كالبغال، فإذا استغاث أهل جهنم أن يخفف عنهم، قيل: اخرجوا إلى الساحل، فيخرجون، فيأخذ الهوام بشفاههم ووجوههم وما شاء الله، فيكشفهم، فيستغيثون فرارا منها إلى النار ويسلط عليهم الجرب، فيحك واحد جلده حتى يبدو العظم، فيقول أحدهم: يا فلان، هل يؤذيك هذا؟ فيقول: نعم، فيقال: ذلك بما كنت تؤذي المؤمنين.\"",
      "explanation": "رواه أحمد"
    },
    {
      "text":
          "عن عبد الله بن مسعود - رضي الله عنه - قال في قوله - عز وجل -: {زدناهم عذابا فوق العذاب} قال: \"زيدوا عقاربا أنيابها كالنخل الطوال.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن أبي هريرة - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"إن الحميم ليصب على رءوسهم، فينفذ الحميم حتى يخلص إلى جوفه، فيسلت ما في جوفه حتى يمرق من قدميه - وهو الصهر - ثم يعاد كما كان.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن أنس بن مالك - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"يرسل البكاء على أهل النار، فيبكون حتى تنقطع الدموع.\"",
      "explanation": "رواه أحمد"
    },
    {
      "text":
          "عن أبي موسى الأشعري - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"إن أهل النار ليبكون، حتى لو أجريت السفن في دموعهم لجرت، وإنهم ليبكون الدم - يعني مكان الدمع.\"",
      "explanation": "رواه أحمد"
    },
    {
      "text":
          "عن عياض بن حمار المجاشعي - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"أهل النار خمسة: الضعيف الذي لا زبر له، الذين هم فيكم تبع، لا يبتغون أهلا ولا مالا، والخائن الذي لا يخفى عليه طمع وإن دق إلا خانه، ورجل لا يصبح ولا يمسي إلا وهو يخادعك عن أهلك ومالك، وذكر البخل أو الكذب، والشنظير الفحاش.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن عبد الله بن عمرو - رضي الله عنهما - قال: قال رسول الله - صلى الله عليه وسلم -: \"ألا أخبركم بأهل النار؟\" قالوا: بلى يا رسول الله، قال: \"كل عتل جواظ مستكبر، جعظري جماع مناع.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن أبي هريرة - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"تحاجت النار والجنة، فقالت النار: أوثرت بالمتكبرين والمتجبرين، وقالت الجنة: ما لي لا يدخلني إلا ضعفاء الناس وسقطهم وعجزهم؟ فقال الله تبارك وتعالى للجنة: أنت رحمتي أرحم بك من أشاء من عبادي، وقال للنار: أنت عذابي أعذب بك من أشاء من عبادي، ولكل واحدة منكما علي ملؤها، فأما النار فلا تمتلئ حتى يضع الله تبارك وتعالى رجله، وفي رواية: قدمه عليها، فهنالك تمتلئ، ويزوى بعضها إلى بعض، فتقول: قط، قط، قط، بعزتك وكرمك، ولا يظلم الله - عز وجل - من خلقه أحدا، وأما الجنة فيبقى فيها ما شاء الله أن يبقى، فينشئ لها خلقا، فيسكنهم فضل الجنة.\"",
      "explanation": "رواه مسلم"
    },
    {
      "text":
          "عن أبي هريرة - رضي الله عنه - قال: قال رسول الله - صلى الله عليه وسلم -: \"إذا أدخل الله أهل الجنة الجنة، وأهل النار النار، أتي بالموت كبشا أملحا ملببا فيوقف على السور بين أهل الجنة وأهل النار، ثم يقال: يا أهل الجنة، فيطلعون خائفين وجلين أن يخرجوا من مكانهم الذي هم فيه، ثم يقال: يا أهل النار، فيطلعون مستبشرين فرحين أن يخرجوا من مكانهم الذي هم فيه، ويرون أن قد جاء الفرج، فيقال لأهل الجنة وأهل النار: هل تعرفون هذا؟ فيقول هؤلاء وهؤلاء: قد عرفناه، هو الموت الذي وكل بنا، فيؤمر به فيضجع، فيذبح ذبحا على السور الذي بين الجنة والنار، ثم يقال للفريقين كلاهما: يا أهل الجنة، خلود فيما تجدون، لا موت فيها أبدا، ويا أهل النار، خلود فيما تجدون، لا موت فيها أبدا، فيزداد أهل الجنة فرحا إلى فرحهم، ويزداد أهل النار حزنا إلى حزنهم.\"",
      "explanation": "رواه مسلم"
    },
  ];

  @override
  Widget build(BuildContext context) {
    final favoritesProvider = Provider.of<FavoritesProvider>(context);

    return Scaffold(
      appBar: AppBar(
        title: Text(
          'أحاديث عن النار',
        ),
      ),
      body: Container(
        color: Colors.yellow[50], // لون الخلفية الأصفر الخفيف
        child: AnimationLimiter(
          child: ListView.builder(
            padding: EdgeInsets.all(16),
            itemCount: _dhikrList.length,
            itemBuilder: (context, index) {
              final dhikr = _dhikrList[index];

              return AnimationConfiguration.staggeredList(
                position: index,
                duration: const Duration(milliseconds: 375),
                child: SlideAnimation(
                  verticalOffset: 50.0,
                  child: FadeInAnimation(
                    child: Dismissible(
                      key: UniqueKey(),
                      background: Container(color: Colors.transparent),
                      child: Padding(
                        padding: const EdgeInsets.symmetric(vertical: 8.0),
                        child: Container(
                          decoration: BoxDecoration(
                            color: Colors.yellow[50], // خلفية الحاوية
                            borderRadius: BorderRadius.circular(12),
                            boxShadow: [
                              BoxShadow(
                                offset: Offset(0, 4),
                                blurRadius: 8,
                                color: blue.withOpacity(0.3),
                              ),
                            ],
                          ),
                          child: Column(
                            crossAxisAlignment: CrossAxisAlignment.start,
                            children: [
                              Padding(
                                padding: const EdgeInsets.symmetric(
                                  horizontal: 16,
                                  vertical: 12,
                                ),
                                child: Center(
                                  child: Text(
                                    dhikr['text'] ??
                                        'نص غير متوفر', // استخدم قيمة افتراضية في حالة null
                                    style: GoogleFonts.amiri(
                                        fontSize: 19,
                                        color: blue,
                                        fontWeight: FontWeight.w900),
                                    textAlign: TextAlign.center,
                                  ),
                                ),
                              ),
                              Padding(
                                padding: const EdgeInsets.symmetric(
                                  horizontal: 16,
                                  vertical: 4,
                                ),
                                child: Center(
                                  child: Text(
                                    dhikr['explanation'] ??
                                        'تفسير غير متوفر', // استخدم قيمة افتراضية في حالة null
                                    style: GoogleFonts.scheherazadeNew(
                                        fontSize: 16,
                                        color: blue, // لون التفسير
                                        fontWeight: FontWeight.w900),
                                  ),
                                ),
                              ),
                              Padding(
                                padding: const EdgeInsets.all(10.0),
                                child: GestureDetector(
                                  child: Row(
                                    mainAxisAlignment: MainAxisAlignment.center,
                                    crossAxisAlignment: CrossAxisAlignment.end,
                                    children: [
                                      IconButton(
                                        icon: Icon(
                                          favoritesProvider.isFavorite(
                                                  dhikr['text'] ??
                                                      '') // تحقق من حالة الذكر
                                              ? Icons
                                                  .favorite // رمز القلب الممتلئ
                                              : Icons
                                                  .favorite_border, // رمز القلب الفارغ
                                          color: favoritesProvider.isFavorite(
                                                  dhikr['text'] ?? '')
                                              ? blue // اللون الأزرق عندما يكون مفضلاً
                                              : blue, // اللون الأزرق عندما لا يكون مفضلاً
                                        ),
                                        onPressed: () {
                                          setState(() {
                                            if (favoritesProvider.isFavorite(
                                                dhikr['text'] ?? '')) {
                                              favoritesProvider.removeFavorite(
                                                  dhikr['text'] ?? '');
                                            } else {
                                              favoritesProvider.addFavorite(
                                                  dhikr['text'] ?? '',
                                                  explanation:
                                                      dhikr['explanation'],
                                                  backgroundImage:
                                                      'images/nar.jpg');
                                            }
                                          });
                                        },
                                      ),
                                      SizedBox(width: 10),
                                      IconButton(
                                        icon: Icon(
                                          Icons.share,
                                          color: blue, // اللون الأزرق
                                        ),
                                        onPressed: () {
                                          Share.share(
                                            'النص: ${dhikr['text'] ?? 'نص غير متوفر'} \nالتفسير: ${dhikr['explanation'] ?? 'تفسير غير متوفر'}',
                                            subject: 'مشاركة ذكر',
                                          );
                                        },
                                      ),
                                      SizedBox(width: 10),
                                      IconButton(
                                        icon: Icon(
                                          Icons.copy,
                                          color: blue, // اللون الأزرق
                                        ),
                                        onPressed: () {
                                          Clipboard.setData(
                                            ClipboardData(
                                              text:
                                                  'النص: ${dhikr['text'] ?? 'نص غير متوفر'} \nالتفسير: ${dhikr['explanation'] ?? 'تفسير غير متوفر'}',
                                            ),
                                          );
                                          ScaffoldMessenger.of(context)
                                              .showSnackBar(
                                            SnackBar(
                                              content: Text(
                                                'تم نسخ النص إلى الحافظة',
                                                style: TextStyle(fontSize: 16),
                                              ),
                                            ),
                                          );
                                        },
                                      ),
                                    ],
                                  ),
                                ),
                              ),
                            ],
                          ),
                        ),
                      ),
                    ),
                  ),
                ),
              );
            },
          ),
        ),
      ),
    );
  }
}
