import 'package:flutter/material.dart';

class MyHomePage extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.yellow[50],
      appBar: AppBar(title: Text('كتاب التوحيد')),
      body: SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Container(
          color: Colors.yellow[50],
          child: InteractiveViewer(
            panEnabled: true, // يسمح بالسحب
            boundaryMargin: EdgeInsets.all(80),
            minScale: 0.5,
            maxScale: 2.5,
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: <Widget>[
                Text(
                  'وقول الله تعالى: ﴿وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ﴾ [الذاريات: ٥٦].',
                  style: TextStyle(
                    fontSize: 18,
                    color: Colors.red,
                    fontFamily: 'Amiri',
                  ),
                ),
                SizedBox(height: 16.0),
                Text(
                  'ــ\n'
                  'موضوع هذا الكتاب: بيان التوحيد الذي أوجبه الله على عباده، وخلَقهم لأجله وبيان ما ينافيه من الشرك الأكبر، أو ينافي كماله الواجب أو المستحب من الشرك الأصغر والبدع.\n\n'
                  'ومعنى كتاب: مصدر كَتَبَ بمعنى جمع، والكتابة بالقلم جمع الحروف والكلمات.\n'
                  'والتوحيد: مصدرُ وحّده، أي جعله واحدًا -والمراد به هنا: إفراد الله بالعبادة.\n'
                  'وخلقت: الخلق هو إبداع الشيء من غير أصل ولا احتذاء.\n'
                  'ليعبدون: العبادة في اللغة: التذلّل والخضوع. وشرعًا: اسمٌ جامعٌ لما يحبه الله ويرضاه من الأقوال والأعمال الظاهرة والباطنة.\n\n'
                  'والمعنى الإجمالي للآية: أن الله -تعالى- أخبر أنه ما خلق الإنس والجن إلا لعبادته، فهي بيانٌ للحكمة في خلقهم، فلم يرد منهم ما تريده السادة من عبيدها من الإعانة لهم بالرزق والإطعام، وإنما أراد المصلحة لهم.\n\n'
                  'ومناسبة الآية للباب: أنها تدل على وجوب التوحيد، الذي هو إفراد الله بالعبادة. لأنه ما خلق الجن والإنس إلا لأجل ذلك.\n\n'
                  'ما يستفاد من الآية:\n'
                  '١- وجوب إفراد الله بالعبادة على جميع الثّقلين؛ الجن والإنس.\n'
                  '٢- بيان الحكمة من خلق الجن والإنس.\n'
                  '٣- أن الخالق هو الذي يستحق العبادة دون غيره ممن لا يخلُق، ففي هذا ردٌّ على عُبّاد الأصنام.\n'
                  '٤- بيان غنى الله ﷾ عن خلقه وحاجة الخلق إليه، لأنه هو الخالق، وهم مخلوقون.\n'
                  '٥- إثبات الحكمة في أفعال الله سبحانه.\n\n',
                  style: TextStyle(
                    fontSize: 16,
                    fontFamily: 'Amiri',
                  ),
                ),
                SizedBox(height: 16.0),
                Text(
                  'وقوله: ﴿وَلَقَدْ بَعَثْنَا فِي كُلِّ أُمَّةٍ رَّسُولًا أَنِ اعْبُدُواْ اللهَ وَاجْتَنِبُواْ الطَّاغُوتَ﴾ [النحل: ٣٦].',
                  style: TextStyle(
                    fontSize: 18,
                    color: Colors.red,
                    fontFamily: 'Amiri',
                  ),
                ),
                SizedBox(height: 16.0),
                Text(
                  'ــ\n'
                  'بعثْنا: أرسلنا.\n'
                  'كل أمّة: كل طائفةٍ وقرنٍ وجيلٍ من الناس.\n'
                  'رسولًا: الرسول: من أُوحي إليه بشرعٍ، وأُمر بتبليغه.\n'
                  'اعبدوا الله: أفردوه بالعبادة.\n'
                  'واجتنبوا: اتركوا، وفارقوا.\n'
                  'الطاغوت: مشتقٌّ من الطغيان، وهو مجاوزة الحد، فكل ما عُبد من دون الله - وهو راض بالعبادة - فهو طاغوت.\n\n'
                  'المعنى الإجمالي للآية: أن الله سبحانه يخبر أنه أرسل في كل طائفة وقرن من الناس رسولًا، يدعوهم إلى عبادة الله وحده، وترك عبادة ما سواه، فلم يزل يُرسل الرسل إلى الناس بذلك منذ حدث الشرك في بني آدم في عهد نوح إلى أن ختمهم بمحمد ﷺ.\n\n'
                  'مناسبة الآية للباب: أن الدعوة إلى التوحيد والنهيَ عن الشرك هي مهمة جميع الرسل وأتباعهم.\n\n'
                  'ما يُستفاد من الآية:\n'
                  '١- أن الحكمة من إرسال الرسل هي الدعوة إلى التوحيد والنهي عن الشرك.\n'
                  '٢- أن دين الأنبياء واحد، وهو إخلاص العبادة لله وترك الشرك وإن اختلفت شرائعهم.\n'
                  '٣- أن الرسالة عمّت كل الأمم، وقامت الحجة على كل العباد.\n'
                  '٤- عظم شأن التوحيد، وأنه واجبٌ على جميع الأمم.\n'
                  '٥- في الآية ما في (لا إله إلا الله) من النفي والإثبات، فدلت على أنه لا يستقيم التوحيد إلا بهما جميعًا، وأن النفي المحض ليس بتوحيد، والإثبات المحض ليس بتوحيد.\n\n',
                  style: TextStyle(
                    fontSize: 16,
                    fontFamily: 'Amiri',
                  ),
                ),
                SizedBox(height: 16.0),
                Text(
                  'وقوله: ﴿وَقَضَى رَبُّكَ أَلاَّ تَعْبُدُواْ إِلَّا إِيَّاهُ وَبِالْوَالِدَيْنِ إِحْسَانًا﴾ [الإسراء: ٢٣] الآية (١).',
                  style: TextStyle(
                    fontSize: 18,
                    color: Colors.red,
                    fontFamily: 'Amiri',
                  ),
                ),
                SizedBox(height: 16.0),
                Text(
                  'ــ\n'
                  'قضى: أمر ووصّى، والمراد بالقضاء هنا القضاء الشرعيّ الدينيّ، لا القضاء القدريّ الكونيّ.\n'
                  'ربك: الرب هو المالك المتصرف، الذي ربى جميع العالمين بنعمته.\n'
                  'ألا تعبدوا إلا إياه: أي أن تعبدوه ولا تعبدوا غيره.\n'
                  'وبالوالدين إحسانًا: أي وقضى أن تحسنوا بالوالدين إحسانًا، كما قضى أن تعبدوه، ولا تعبدوا غيره.\n\n'
                  'المعنى الإجمالي للآية: الإخبار أن الله ﷾ أمر ووصّى على ألسُن رسله أن يُعبد وحده دون ما سواه، وأن يحسن الولد إلى والديه إحسانًا بالقول والفعل، ولا يسيء إليهما؛ لأنهما اللذان قاما بتربيته في حال صِغره وضعفه، حتى قوِي واشتد.\n\n'
                  'مناسبة الآية للباب: أن التوحيد هو آكد الحقوق وأوجب الواجبات؛ لأن الله بدأ به في الآية، ولا يبتدأ إلا بالأهم فالأهم.\n\n'
                  'ما يستفاد من الآية:\n'
                  '١- أن التوحيد هو أول ما أمر الله به من الواجبات، وهو أول الحقوق الواجبة على العبد.\n'
                  '٢- ما في كلمة (لا إله إلا الله) من النفي والإثبات، ففيها دليلٌ على أن التوحيد لا يقوم إلا على النفي والإثبات: (نفي العبادة عما سوى الله وإثباتها لله)، كما سبق.\n'
                  '٣- عظمة حق الوالدين حيث عطف حقهما على حقه، وجاء في المرتبة الثانية.\n'
                  '٤- وجوب الإحسان إلى الوالدين بجميع أنواع الإحسان، لأنه لم يخص نوعًا دون نوع.\n'
                  '٥- تحريم عقوق الوالدين.\n\n',
                  style: TextStyle(
                    fontSize: 16,
                    fontFamily: 'Amiri',
                  ),
                ),
                SizedBox(height: 16.0),
                Text(
                  'وقوله: ﴿وَاعْبُدُواْ اللهَ وَلاَ تُشْرِكُواْ بِهِ شَيْئًا ...﴾ [النساء: ٣٦] الآية.',
                  style: TextStyle(
                    fontSize: 18,
                    color: Colors.red,
                    fontFamily: 'Amiri',
                  ),
                ),
                SizedBox(height: 16.0),
                Text(
                  'ــ\n'
                  'اعبدوا الله: أي أفردوه بالعبادة.\n'
                  'ولا تشركوا به شيئًا: لا قليلًا ولا كثيرًا، لا جنيًا ولا إنسيًا، لا حيًا ولا ميتًا، لا نبيًا ولا وليًا.\n\n'
                  'المعنى الإجمالي للآية: يأمر الله ﷾ عباده المؤمنين بأن يعبدوه وحده لا شريك له، وألا يشركوا به شيئًا كائنًا ما كان، وينبغي أن يكون الاهتمام بالتوحيد أولًا قبل كل شيء.\n\n'
                  'مناسبة الآية للباب: أن قوله: ﴿اعبدوا الله ولا تشركوا به شيئًا﴾ فيه الأمر بالتوحيد والنهي عن الشرك، وذلك هو معنى لا إله إلا الله.\n\n'
                  'ما يستفاد من الآية:\n'
                  '١- وجوب إفراد الله بالعبادة.\n'
                  '٢- تحريم الشرك.\n'
                  '٣- أنه لا يستحق العبادة أحد سوى الله، لا نبيّ ولا ملك ولا غيره.\n'
                  '٤- عظم شأن التوحيد وأنه أول الواجبات.\n\n',
                  style: TextStyle(
                    fontSize: 16,
                    fontFamily: 'Amiri',
                  ),
                ),
                // هنا تستطيع إضافة المزيد من النصوص أو العناصر كما هو مطلوب
              ],
            ),
          ),
        ),
      ),
    );
  }
}

void main() => runApp(MaterialApp(
      home: MyHomePage(),
    ));
